zephyrproject-rtos/zephyr/drivers/i2s/i2s_stm32.c
	/* NOTE: UDR error must be explicitly cleared on STM32H7 */
	if (LL_I2S_IsActiveFlag_UDR(cfg->i2s)) {
		i2s_stm32_irq_udr_count++;
		LL_I2S_ClearFlag_UDR(cfg->i2s);
	}

	i2s_stm32_irq_count++;
}

static int i2s_stm32_initialize(const struct device *dev)
{
	const struct i2s_stm32_cfg *cfg = dev->config;
	struct i2s_stm32_data *const dev_data = dev->data;
	struct stream *stream = &dev_data->tx;
	int ret, i;

	/* Initialize the variable used to handle the TX */
	stream->tx_stop_for_drain = false;

	/* Enable I2S clock propagation */
	ret = i2s_stm32_enable_clock(dev);
	if (ret < 0) {
		LOG_ERR("%s: clock enabling failed: %d",  __func__, ret);
		return -EIO;
	}

#ifdef CONFIG_STM32_HAL2
	LL_I2S_EnableI2SMode(cfg->i2s);
#endif

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_i2s)
	if (cfg->ioswp) {
		LL_I2S_EnableIOSwap(cfg->i2s);
	}
#endif

	/* Configure dt provided device signals when available */
	ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		LOG_ERR("I2S pinctrl setup failed (%d)", ret);
		return ret;
	}

	cfg->irq_config(dev);

	for (i = 0; i < STM32_DMA_NUM_CHANNELS; i++) {
		active_dma_rx_channel[i] = NULL;
		active_dma_tx_channel[i] = NULL;
	}

	/* Get the binding to the DMA device */
	if (!device_is_ready(dev_data->tx.dev_dma)) {
		LOG_ERR("%s device not ready", dev_data->tx.dev_dma->name);
		return -ENODEV;
	}
	if (!device_is_ready(dev_data->rx.dev_dma)) {
		LOG_ERR("%s device not ready", dev_data->rx.dev_dma->name);
		return -ENODEV;
	}

	LOG_INF("%s inited", dev->name);

	return 0;
}

static int rx_stream_start(struct stream *stream, const struct device *dev)
{
	const struct i2s_stm32_cfg *cfg = dev->config;
	int ret;

	ret = k_mem_slab_alloc(stream->cfg.mem_slab, &stream->mem_block,
			       K_NO_WAIT);
	if (ret < 0) {
		return ret;
	}

	if (stream->master) {
		LL_I2S_SetTransferMode(cfg->i2s, LL_I2S_MODE_MASTER_RX);
	} else {
		LL_I2S_SetTransferMode(cfg->i2s, LL_I2S_MODE_SLAVE_RX);
	}

	/* remember active RX DMA channel (used in callback) */
	active_dma_rx_channel[stream->dma_channel] = dev;

	ret = start_dma(stream->dev_dma, stream->dma_channel,
			&stream->dma_cfg,
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_i2s)
			(void *)LL_SPI_DMA_GetRxRegAddr(cfg->i2s),
#else
			(void *)LL_SPI_DMA_GetRegAddr(cfg->i2s),
#endif
			stream->src_addr_increment, stream->mem_block,
			stream->dst_addr_increment, stream->fifo_threshold,
			stream->cfg.block_size);
	if (ret < 0) {
		LOG_ERR("Failed to start RX DMA transfer: %d", ret);
		return ret;
	}

	LL_I2S_EnableDMAReq_RX(cfg->i2s);

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_i2s)
	LL_I2S_EnableIT_OVR(cfg->i2s);
	LL_I2S_EnableIT_UDR(cfg->i2s);
	LL_I2S_EnableIT_FRE(cfg->i2s);
	LL_I2S_Enable(cfg->i2s);
	LL_SPI_StartMasterTransfer(cfg->i2s);
#else
	LL_I2S_EnableIT_ERR(cfg->i2s);
	LL_I2S_Enable(cfg->i2s);
#endif


	return 0;
}

static int tx_stream_start(struct stream *stream, const struct device *dev)
{
	const struct i2s_stm32_cfg *cfg = dev->config;
	size_t mem_block_size = 0;
	int ret;

	ret = queue_get(stream->msgq, &stream->mem_block,
			&mem_block_size, 0);
	if (ret < 0) {
		LOG_ERR("queue_get() <FAILED>: ret=%d, used=%d/%d", ret,
			k_msgq_num_used_get(stream->msgq), CONFIG_I2S_STM32_TX_BLOCK_COUNT);
		return ret;
	}

	/* Assure cache coherency before DMA read operation */
	sys_cache_data_flush_range(stream->mem_block, mem_block_size);

	if (stream->master) {
		LL_I2S_SetTransferMode(cfg->i2s, LL_I2S_MODE_MASTER_TX);
	} else {
		LL_I2S_SetTransferMode(cfg->i2s, LL_I2S_MODE_SLAVE_TX);
	}

	/* remember active TX DMA channel (used in callback) */
	active_dma_tx_channel[stream->dma_channel] = dev;

	ret = start_dma(stream->dev_dma, stream->dma_channel,
			&stream->dma_cfg,
			stream->mem_block, stream->src_addr_increment,
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_i2s)
			(void *)LL_SPI_DMA_GetTxRegAddr(cfg->i2s),
#else
			(void *)LL_SPI_DMA_GetRegAddr(cfg->i2s),
#endif
			stream->dst_addr_increment, stream->fifo_threshold,
			stream->cfg.block_size);
	if (ret < 0) {
		LOG_ERR("Failed to start TX DMA transfer: %d", ret);
		return ret;
	}

	LL_I2S_EnableDMAReq_TX(cfg->i2s);

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_i2s)
	LL_I2S_EnableIT_OVR(cfg->i2s);
	LL_I2S_EnableIT_UDR(cfg->i2s);
	LL_I2S_EnableIT_FRE(cfg->i2s);

	LL_I2S_Enable(cfg->i2s);
	LL_SPI_StartMasterTransfer(cfg->i2s);
#else
	LL_I2S_EnableIT_ERR(cfg->i2s);
	LL_I2S_Enable(cfg->i2s);
#endif

	return 0;
}

static void rx_stream_disable(struct stream *stream, const struct device *dev)
{
	const struct i2s_stm32_cfg *cfg = dev->config;

	LL_I2S_Disable(cfg->i2s);

	LL_I2S_DisableDMAReq_RX(cfg->i2s);
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_i2s)
	LL_I2S_DisableIT_OVR(cfg->i2s);
	LL_I2S_DisableIT_UDR(cfg->i2s);
	LL_I2S_DisableIT_FRE(cfg->i2s);
#else
	LL_I2S_DisableIT_ERR(cfg->i2s);
#endif

	dma_stop(stream->dev_dma, stream->dma_channel);
	if (stream->mem_block != NULL) {
		k_mem_slab_free(stream->cfg.mem_slab, stream->mem_block);
		stream->mem_block = NULL;
	}

	active_dma_rx_channel[stream->dma_channel] = NULL;
}

static void tx_stream_disable(struct stream *stream, const struct device *dev)
{
	const struct i2s_stm32_cfg *cfg = dev->config;

	/* Wait for TX queue to drain before disabling */
	k_busy_wait(100);
	LL_I2S_Disable(cfg->i2s);

	LL_I2S_DisableDMAReq_TX(cfg->i2s);
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_i2s)
	LL_I2S_DisableIT_OVR(cfg->i2s);
	LL_I2S_DisableIT_UDR(cfg->i2s);
	LL_I2S_DisableIT_FRE(cfg->i2s);
#else
	LL_I2S_DisableIT_ERR(cfg->i2s);
#endif

	dma_stop(stream->dev_dma, stream->dma_channel);
	if (stream->mem_block != NULL) {
		k_mem_slab_free(stream->cfg.mem_slab, stream->mem_block);
		stream->mem_block = NULL;
	}

	active_dma_tx_channel[stream->dma_channel] = NULL;
}

static const struct device *get_dev_from_rx_dma_channel(uint32_t dma_channel)
{
	return active_dma_rx_channel[dma_channel];
}

static const struct device *get_dev_from_tx_dma_channel(uint32_t dma_channel)
{
	return active_dma_tx_channel[dma_channel];
}

/* src_dev and dest_dev should be 'MEMORY' or 'PERIPHERAL'. */
#define I2S_DMA_CHANNEL_INIT(index, dir, dir_cap, src_dev, dest_dev)		\
	.dir = {								\
		.dev_dma = DEVICE_DT_GET(STM32_DT_INST_DMA_CTLR(index, dir)),	\
		.dma_channel = DT_INST_DMAS_CELL_BY_NAME(index, dir, channel),	\
		.dma_cfg = {							\
			.block_count = 2,					\
			.dma_slot = STM32_DT_INST_DMA_SLOT(index, dir),		\
			.channel_direction = src_dev##_TO_##dest_dev,		\
			.source_data_size = 2,  /* 16bit default */		\
			.dest_data_size = 2,    /* 16bit default */		\
			/* single transfers (burst length = data size) */	\
			.source_burst_length = 2,				\
			.dest_burst_length = 2,					\
			.channel_priority = STM32_DMA_CONFIG_PRIORITY(		\
				STM32_DT_INST_DMA_CHANNEL_CONFIG(index, dir)),	\
			.dma_callback = dma_##dir##_callback,			\
		},								\
		.src_addr_increment = STM32_DMA_CONFIG_##src_dev##_ADDR_INC(	\
			STM32_DT_INST_DMA_CHANNEL_CONFIG(index, dir)),		\
		.dst_addr_increment = STM32_DMA_CONFIG_##dest_dev##_ADDR_INC(	\
			STM32_DT_INST_DMA_CHANNEL_CONFIG(index, dir)),		\
		.fifo_threshold = STM32_DMA_FEATURES_FIFO_THRESHOLD(		\
			STM32_DT_INST_DMA_FEATURES(index, dir)),		\
		.stream_start = dir##_stream_start,				\
		.stream_disable = dir##_stream_disable,				\
		.msgq = &dir##_##index##_queue,					\
	}

#define I2S_STM32_INIT(index)							\
										\
	static void i2s_stm32_irq_config_func_##index(const struct device *dev);\
										\
	PINCTRL_DT_INST_DEFINE(index);						\
										\
	static const struct stm32_pclken clk_##index[] = STM32_DT_INST_CLOCKS(index); \
										\
	static const struct i2s_stm32_cfg i2s_stm32_config_##index = {		\
		.i2s = (SPI_TypeDef *)DT_INST_REG_ADDR(index),			\
		.pclken = clk_##index,						\
		.pclk_len = DT_INST_NUM_CLOCKS(index),				\
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),			\
		.irq_config = i2s_stm32_irq_config_func_##index,		\
		.master_clk_sel = DT_INST_PROP(index, mck_enabled),		\
		.ioswp = DT_INST_PROP(index, ioswp),				\
	};									\
										\
	K_MSGQ_DEFINE_STATIC_TYPE(rx_##index##_queue, struct queue_item,	\
				  CONFIG_I2S_STM32_RX_BLOCK_COUNT);		\
	K_MSGQ_DEFINE_STATIC_TYPE(tx_##index##_queue, struct queue_item,	\
				  CONFIG_I2S_STM32_TX_BLOCK_COUNT);		\
										\
	static struct i2s_stm32_data i2s_stm32_data_##index = {			\
		IF_ENABLED(DT_INST_DMAS_HAS_NAME(index, rx),			\
			   (I2S_DMA_CHANNEL_INIT(index, rx, RX, PERIPHERAL, MEMORY))),\
		IF_ENABLED(DT_INST_DMAS_HAS_NAME(index, tx),			\
			   (I2S_DMA_CHANNEL_INIT(index, tx, TX, MEMORY, PERIPHERAL))),\
	};									\
	DEVICE_DT_INST_DEFINE(index,						\
			      &i2s_stm32_initialize, NULL,			\
			      &i2s_stm32_data_##index,				\
			      &i2s_stm32_config_##index, POST_KERNEL,		\
			      CONFIG_I2S_INIT_PRIORITY, &i2s_stm32_driver_api);	\
										\
	static void i2s_stm32_irq_config_func_##index(const struct device *dev)	\
	{									\
		IRQ_CONNECT(DT_INST_IRQN(index),				\
			    DT_INST_IRQ(index, priority),			\
			    i2s_stm32_isr, DEVICE_DT_INST_GET(index), 0);	\
		irq_enable(DT_INST_IRQN(index));				\
	}

DT_INST_FOREACH_STATUS_OKAY(I2S_STM32_INIT)
